fish/fish.org
#+TITLE: fish configuration
#+PROPERTY: header-args+ :results output silent :noweb tangle :comments both :mkdirp yes

* config.fish
:PROPERTIES:
:header-args+: :tangle config.fish
:END:

Use [[https://starship.rs/][starship prompt]]
#+begin_src sh
starship init fish | source
#+end_src

** login options
These options need to be set only when logging in i.e. the first time

Set the theme. Check if ~$BASE16_THEME~ is defined and set the theme only if it isn't
I need to figure out when this should be called. I probably don't want to invoke this for non-login shells
#+begin_src sh
if status --is-login
    if set -q XDG_CONFIG_HOME
        set -Ux BASE16_SHELL $XDG_CONFIG_HOME/base16-shell
    else
        set -Ux BASE16_SHELL ~/.config/base16-shell
    end

    if set -q BASE16_SHELL
        source "$BASE16_SHELL/profile_helper.fish"
    end
end
#+end_src

#+begin_src sh
fish_add_path ~/bin
#+end_src

* aliases
#+begin_src sh :header-args+: :tangle functions/l.fish
function l --wraps=ls
  ls $argv;
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/la.fish
function la --wraps=ls
  ls -A $argv;
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/c.fish
function c --wraps=clear
  clear $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/cl.fish
function cl
  clear
  ls
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/mv.fish
function mv
  command mv -vi $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/cp.fish
function cp
  command cp -vi $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/rm.fish
function rm
  command rm -vi $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/rd.fish
function rd --wraps=rm
  rm -rf $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/ln.fish
function ln
  command ln -svi $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/C.fish
function C --wraps=cat
  cat $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/j.fish
function j --wraps=jobs
  jobs -l $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/x.fish
function x --wraps=exit
  exit $argv
end
#+end_src

** grep, rg etc.
#+begin_src sh :tangle (if (executable-find "rg") "no" "functions/g.fish")
function g --wraps=grep
  grep $argv
end
#+end_src

#+begin_src sh :tangle (if (executable-find "rg") "functions/g.fish" "no")
function g --wraps=rg
  rg $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/gi.fish
function gi --wraps=g
  g -i $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/gv.fish
function gv --wraps=g
  g -v $argv
end
#+end_src

** vim
#+begin_src sh :header-args+: :tangle functions/v.fish
function v --wraps=vim
  vim $argv
end
#+end_src

#+begin_src sh :header-args+: :tangle functions/vd.fish
function vd --wraps=vim
  vim -d $argv
end
#+end_src
